OpenFOAM case folders/Experimental validation/Static drift/FoilShipSharp/T0.22_Fr0.2_alpha0.0/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "constant";
	object      dynamicMeshDict;
}

dynamicFvMesh       dynamicMotionSolverFvMesh;
motionSolverLibs    ("libsixDoFRigidBodyMotion.so");
solver              sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
	patches                   (hull deck trailingEdge);
	innerDistance             0.22000000000000003;
	outerDistance             2.2;
	centreOfMass              (-0.279000000 0.000000000 0.000000000);
	mass                      229.043675;
	momentOfInertia           (10.464413815 370.447605156 379.064399992);
	rhoInf                    1;
	report                    on;
	reportToFile              on;
	value                     uniform (0 0 0);
	accelerationRelaxation    0.4;
	accelerationDamping       0.9;
	solver
	{
		type    Newmark;
	}
	constraints
	{
		zAxis
		{
			sixDoFRigidBodyMotionConstraint    line;
			direction                          (0 0 1);
		}
		yPlane
		{
			sixDoFRigidBodyMotionConstraint    axis;
			axis                               (0.000000 1.000000 0);
		}
	}
	restraints
	{
		translationDamper
		{
			sixDoFRigidBodyMotionRestraint    linearDamper;
			coeff                             8550.007140598178;
		}
		rotationDamper
		{
			sixDoFRigidBodyMotionRestraint    sphericalAngularDamper;
			coeff                             14150.154230100137;
		}
	}
}

